import math
'''
Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.

Пример:

- A (3,6); B (2,1) -> 5,09
- A (7,-5); B (1,-1) -> 7,21
'''

ax = int(input("Введите координату точки А по оси X: "))
ay = int(input("Введите координату точки А по оси Y: "))
bx = int(input("Введите координату точки B по оси X: "))
by = int(input("Введите координату точки B по оси Y: "))

if ax > bx: x = ax - bx
else: x = bx - ax

if ay > by: y = ay - by
else: y = by - ay

distance = (x ** 2 + y ** 2)
print(round((math.sqrt(distance)), 3))